Tekla.Structures.Plugins.DirectManipulation.Core.Features.CustomPartPluginManipulationFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase class provides the base class for manipulation features for plugins.
Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase

Tekla.Structures.Plugins.DirectManipulation.Core.Features.CustomPartPluginManipulationFeatureBase.#ctor(System.String,System.Boolean)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Core.Features.CustomPartPluginManipulationFeatureBase class.
name: The name of the custom part plugin.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.